## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_resource_group.app_rg must be replaced
-/+ resource "azurerm_resource_group" "app_rg" {
      ~ id         = "/subscriptions/3ff6241d-193e-4890-83c8-ec67889882c7/resourceGroups/group10-app-rg" -> (known after apply)
      ~ name       = "group10-app-rg" -> "cst8918-final-project-group-10" # forces replacement
      - tags       = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.network.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "canadacentral"
      + name     = "cst8918-final-project-group-10"
      + tags     = {
          + "Cost Center" = "000"
        }
    }

  # module.network.azurerm_subnet.subnet["admin"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.3.0.0/16",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "admin"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "cst8918-final-project-group-10"
      + virtual_network_name                           = "cst8918-final-project-group-10-vnet"
    }

  # module.network.azurerm_subnet.subnet["dev"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.2.0.0/16",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dev"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "cst8918-final-project-group-10"
      + virtual_network_name                           = "cst8918-final-project-group-10-vnet"
    }

  # module.network.azurerm_subnet.subnet["prod"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.0.0.0/16",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "prod"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "cst8918-final-project-group-10"
      + virtual_network_name                           = "cst8918-final-project-group-10-vnet"
    }

  # module.network.azurerm_subnet.subnet["test"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.1.0.0/16",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "test"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "cst8918-final-project-group-10"
      + virtual_network_name                           = "cst8918-final-project-group-10-vnet"
    }

  # module.network.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/14",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "canadacentral"
      + name                = "cst8918-final-project-group-10-vnet"
      + resource_group_name = "cst8918-final-project-group-10"
      + subnet              = (known after apply)
      + tags                = {
          + "Cost Center" = "000"
        }
    }

Plan: 7 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ resource_group_name     = "group10-app-rg" -> "cst8918-final-project-group-10"
```
</details>